# -*- coding: UTF-8 -*-
# @Time : 2021/11/29 20:36
# @Author : 洛基Nickey

import re

"""
有待优化的部分：
①未做日期检查，比如现有程序中，2月31日会被视为合法日期
②只做了初步的数据预处理，对于一些纯中文表示的日期可能会识别错误
③只识别年月日，未识别时分秒
④一次只处理一个日期，如果字符串中包含多个日期，只会识别第一个匹配到的日期
"""

re_month = 'june|july|jan|feb|mar|apr|may|jun|jul|aug|sep|oct|nov|dec'

# 年月日
YMD_1 = re.compile(
    r"((?:\A|\D)(?P<year>20[012]\d)[-|:.,/ 年]{0,3}(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ 月]{0,3}(?P<day>[12]\d|3[01]|0{0,1}\d)(?:\D|$))")  # 2021 7 12     优先级5
YMD_2 = re.compile(
    r"((?:\A|\D)(?P<year>20[012]\d)[-|:.,/ 年]{0,3}(?P<month>%s)[-|:.,/ ]{0,3}(?P<day>[12]\d|3[01]|0{0,1}\d)(?:\D|$))" % re_month)  # 2021 AUG 12         5
YMD_3 = re.compile(
    r"((?:\A|\D)(?P<year>[012]\d)[-|:.,/ ]{0,1}年[-|:.,/ ]{0,1}(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ 月]{1,3}(?P<day>[12]\d|3[01]|0{0,1}\d)(?:\D|$))")  # 21年7 12            4
YMD_4 = re.compile(
    r"((?:\A|\D)(?P<year>[012]\d)[-|:.,/ ]{0,1}年[-|:.,/ ]{0,1}(?P<month>%s)[-|:.,/ ]{1,3}(?P<day>[12]\d|3[01]|0{0,1}\d)(?:\D|$))" % re_month)  # 19年AUG 8           4
# 月日年 需要考虑 1st 2nd 3rd
MDY_1 = re.compile(
    r"((?:\A|\D)(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ 月]{1,3}(?P<day>[12]\d|3[01]|0{0,1}\d)[d-t]{0,2}[-|:.,/ 日号]{1,2}(?P<year>20[012]\d)(?:\D|$))")  # 7/12/2021        5
MDY_2 = re.compile(
    r"((?:\A|\D)(?P<month>%s)[-|:.,/ ]{1,3}(?P<day>[12]\d|3[01]|0{0,1}\d)[d-t]{0,2}[-|:.,/ 日]{1,3}(?P<year>20[012]\d)(?:\D|$))" % re_month)  # AUG/12ND/2021    5

# 日月年 需要考虑 1st 2nd 3rd
DMY_1 = re.compile(
    r"((?:\A|\D)(?P<day>[12]\d|3[01]|0{0,1}\d)[d-t]{0,2}[-|:.,/ 日]{1,3}(?P<month>%s)[-|:.,/ ]{1,3}(?P<year>20[012]\d)(?:\D|$))" % re_month)  # 12ND/AUG/2021  5
DMY_2 = re.compile(
    r"((?:\A|\D)(?P<day>[12]\d|3[01]|0{0,1}\d)[d-t]{0,2}[-|:.,/ 日]{1,3}(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ 月]{1,2}(?P<year>20[012]\d)(?:\D|$))")  # 12ND-12-2021   5
DMY_3 = re.compile(
    r"((?:\A|\D)(?P<day>[12]\d|3[01]|0{0,1}\d)[d-t]{0,2}[-|:.,/ 日]{1,3}(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ 月]{1,2}(?P<year>2\d)(?:\D|$))")
DMY_4 = re.compile(
    r"((?:\A|\D)(?P<day>[12]\d|3[01]|0{0,1}\d)[d-t]{0,2}[-|:.,/ 日]{1,3}(?P<month>%s)[-|:.,/ ]{1,3}(?P<year>2\d)(?:\D|$))" % re_month)

# 年月
YM_1 = re.compile(
    r"((?:\A|\D)(?P<year>20[012]\d)[-|:.,/ 年]{1,3}(?P<month>%s)[-|:.,/ ]{0,1}[上中下]旬(?:\D|$))" % re_month)  # 2021/AUG 上旬     3
YM_2 = re.compile(
    r"((?:\A|\D)(?P<year>20[012]\d)[-|:.,/ 年]{1,3}(?P<month>%s)[-|:.,/ ]{0,1}(?:\D|$))" % re_month)  # 2021/AUG          2
YM_3 = re.compile(
    r"((?:\A|\D)(?P<year>20[012]\d)[-|:.,/ 年]{1,3}(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ 月]{0,2}(?:\D|$))")  # 2021/2        2
YM_4 = re.compile(
    r"((?:\A|\D)(?P<year>20[012]\d)[-|:.,/ 年]{1,3}(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ 月]{0,2}[上中下]旬(?:\D|$))")  # 2021/2月上旬      3

# 月日  ETD9.14 FAL2 	 ('MD_1', ' fal2')
MD_1 = re.compile(
    r"((?:\A|\D)(?P<month>%s)[-|:.,/ ]{0,2}(?P<day>[12]\d|3[01]|0{0,1}\d)[-|:.,/ 日号]{0,2}(?!\d|月))" % re_month)  # AUG/12      2
M_2 = re.compile(
    r"((?:\A|\D)(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ 月]{1,3}[上中下]旬(?!\d|月))")  # 7月上旬     2
MD_3 = re.compile(
    r"((?:\A|\D)(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ ]{0,1}月[-|:.,/ ]{0,1}(?P<day>[12]\d|3[01]|0{0,1}\d)[-|:.,/ 日号]{0,2}(?!\d|月))")  # 7月12       2

# 日月
DM_1 = re.compile(
    r"((?:\A|\D)(?P<day>[12]\d|3[01]|0{0,1}\d)[d-t]{0,2}[-|:.,/ ]{0,3}(?P<month>%s)[-|:.,/ ]{0,2}(?:\D|$))" % re_month)  # 12ND/AUG   2
DM_2 = re.compile(
    r"((?:\A|\D)(?P<day>[12]\d|3[01]|0{0,1}\d)[d-t]{0,2}[-|:.,/ of]{0,4}(?P<month>%s)[-|:.,/ ]{0,2}(?:\D|$))" % re_month)  # 28th of April
DM_3 = re.compile(
    r"((?:\A|\D)(?P<day>[12]\d|3[01]|0{0,1}\d)[d-t]{2}[-|:.,/ 日]{0,3}(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ 月]{1,2}(?:\D|$))")  # 12ND/12月  2
DM_4 = re.compile(
    r"((?:\A|\D)(?P<day>[12]\d|3[01]|0{0,1}\d)[d-t]{2}[-|:.,/ 日]{0,3}(?P<month>%s)(?:\D|$))" % re_month)  # 11MAR      2
DM_5 = re.compile(
    r"((?:\A|\D)(?P<day>[12]\d|3[01]|0{0,1}\d)[-|:.,/ 日]{0,3}(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ ]{0,1}月[-|:.,/ ]{0,3}(?:\D|$))")  # 12 -9月    2

# brevity    类似 10初、 9月底
BR_M_1 = re.compile(
    r"((?:\A|\D)(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ ]{0,1}[月]{0,1}[-|:.,/ ]{0,1}[初中底半上下内](?:\D|$))")  # 9月底     1
BR_MD_2 = re.compile(
    r"((?:\A|\D)(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ 月]{1,3}(?P<day>[12]\d|3[01]|0{0,1}\d)(?:\D|$))")  # ETD9-8    1
BR_D_3 = re.compile(r"((?:\A|\D)(?P<day>[12]\d|3[01]|0{0,1}\d)[-|:.,/ ]{0,1}[日号](?:\D|$))")  # 19号      1
BR_M_4 = re.compile(r"((?:\A|\D)(?P<month>0[1-9]|1[0-2]|[1-9])[-|:.,/ ]{0,1}月(?:\D|$))")  # 7月      1
BR_MY_5 = re.compile(r"((?:\A|\D)(?P<month>%s)[-|:.,/ ]{0,3}(?P<year>20[012]\d)(?:\D|$))" % re_month)  # sep 2021   1

CN_Number = (('十九', '十八', '十七', '十六', '十五', '十四', '十三', '十二', '十一', '十',
              'january', 'february', 'march', 'april', 'may', 'june', 'july', 'august',
              'september', 'sept', 'october', 'november', 'december'),
             ('19', '18', '17', '16', '15', '14', '13', '12', '11', '10',
              'jan', 'feb', 'mar', 'apr', 'may', 'jun', 'jul', 'aug', 'sep', 'sep', 'oct', 'nov', 'dec'))

CE_table = {ord(f): ord(t) for f, t in zip(
    u'，：。！？【】（）％＃＠＆１２３４５６７８９０零一二三四五六七八九壹贰叁肆伍陆柒捌玖_',
    u',:.!?[]()%#@&12345678900123456789123456789/')}

MONTH_table = {"jan": "01", "feb": "02", "mar": "03", "apr": "04",
               "may": "05", "jun": "06", "jul": "07", "aug": "08",
               "sep": "09", "oct": "10", "nov": "11", "dec": "12", "june": "06", "july": "07"}

DAY_table = {"上旬": "05", "中旬": "15", "下旬": "25", "初": "01", "底": "28", "半": "15", "内": "28",
             "上": "05", "中": "15", "下": "25", "之前": "01", "前": "01"}
